.386                           
.model flat, stdcall           
option casemap :none           

include <\masm32\include\kernel32.inc>    ; подключаем файл прототипов функций

includelib <\masm32\lib\kernel32.lib>     ; подключаем файл библиотек

.data  


frequency1 dd 659, 622, 659, 622, 659, 493, 587, 523, 440, 261, 329, 440, 493, 329, 415, 493, 523, 
              329, 659, 622, 659, 622, 659, 493, 587, 523, 440, 261, 329, 440, 493, 329, 523, 493 
             
frequency2 dd 440, 493, 523, 587, 659, 392, 698, 659, 587, 349, 659, 587, 523, 329, 587, 523, 493, 
              164, 329, 329, 659, 329, 659, 659, 1318, 622, 659, 622, 659, 622, 659, 622, 659, 622 
             
frequency3 dd 659, 622, 659, 622, 659, 493, 587, 523, 440, 261, 329, 440, 493, 329, 415, 493, 523, 
              659, 622, 659, 622, 659, 493, 587, 523, 440, 261, 329, 440, 493, 329, 523, 493, 440
              
;=================================================================================================              
          
duration1 dd 200, 200, 200, 200, 200, 200, 200, 200, 600, 200, 200, 200, 600, 200, 200, 200, 600, 
             200, 200, 200, 200, 200, 200, 200, 200, 200, 600, 200, 200, 200, 600, 200, 200, 200
             
duration2 dd 600, 200, 200, 200, 500, 200, 200, 200, 500, 200, 200, 200, 500, 200, 200, 200, 400,
             200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200
             
duration3 dd 200, 200, 200, 200, 200, 200, 200, 200, 600, 200, 200, 200, 600, 200, 200, 200, 600,
             200, 200, 200, 200, 200, 200, 200, 200, 600, 200, 200, 200, 600, 200, 200, 200, 800                 

.code                         

start:                         
;===============================================
    mov edi, 34 ; счетчик цикла в edi
    mov esi, 0  ; индекс начального элемента esi
;===============================================    
  loop1:    
      
      invoke Beep, frequency1[esi], duration1[esi] ; делаем Ѕ»ѕ
      
      ; квадратные скобки - [ ADDR frequency1 + esi ], т.е. смещение по адресу относительно начала на n*sizeof(DWORD)
      
      add esi, 4      ; накручиваем esi 4 (т.к. DWORD => одна €чейка - 4 байта)
      
      dec edi        ; уменьшаем счетчик цикла
      cmp edi, 0     ; сравниваем с нулем
      jnz loop1      ; переходим в loop1 если ZF
      
      
      
      
;     далее алгоритм аналогичен, только дважды меняются массивы в invoke и названия меток   

 
   
       
;===============================================      
  mov edi, 34 ; счетчик цикла в edi
  mov esi, 0  ; индекс начального элемента esi    
;===============================================   
 
  loop2:
      
      invoke Beep, frequency2[si], duration2[si]
      
      add esi, 4
      
      dec edi
      cmp edi, 0
      jnz loop2
      
;===============================================     
  mov edi, 34 ; счетчик цикла в edi
  mov esi, 0  ; индекс начального элемента esi      
;===============================================    
  loop3:
      
      invoke Beep, frequency3[si], duration3[si]
      
      add esi, 4
      
      dec edi
      cmp edi, 0
      jnz loop3
;===============================================   
    invoke ExitProcess, 0  

end start                      